In [3]:
# day_5_lab_9_solutions
# importing essntial libraries, just in case 

import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

from sklearn.metrics import confusion_matrix, accuracy_score, precision_score, recall_score, ConfusionMatrixDisplay
from sklearn.metrics import classification_report, f1_score, cohen_kappa_score

import getpass  # To get the password without showing the input

In [8]:
password = getpass.getpass()

········

In [9]:
# establishing the connection
# create an engine
# declare dataframe

In [10]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)


Create a Python connection with SQL database and retrieve the results of the following queries as dataframes:

1. How many distinct (different) actors' last names are there?

In [11]:
last_name_actors = pd.read_sql_query('select distinct(last_name) from sakila.actor', engine)
last_name_actors.head(10)

   last_name
0     AKROYD
1      ALLEN
2    ASTAIRE
3     BACALL
4     BAILEY
5       BALE
6       BALL
7  BARRYMORE
8   BASINGER
9     BENING

2. Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.

In [23]:
weekend_workday_query = """SELECT *,
                                 CASE
                                 WHEN weekday(rental_date) < 6 then 'workday'
                                 ELSE 'weekend'
                                 END AS 'day_type'
                         FROM rental;"""

weekend_workday_data = pd.read_sql_query(weekend_workday_query, engine)
weekend_workday_data.head()

,rental_id,film_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,day_type
0,1,NaN,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,workday
1,2,NaN,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,workday
2,3,NaN,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,workday
3,4,NaN,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,workday
4,5,NaN,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,workday

3. Get all films with ARMAGEDDON in the title.

In [13]:

film_title_query = "SELECT * FROM film WHERE title LIKE '%%ARMAGEDDON%%'"

film_titles = pd.read_sql_query(film_title_query, engine)
film_titles
# i got a lot of errors so i resorted to a hybrid solution as seen in the following cell..:

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,39,ARMAGEDDON LOST,A Fast-Paced Tale of a Boat And a Teacher who ...,2006,1,None,5,0.99,99,10.99,G,Trailers,2006-02-15 05:03:42
1,507,LADYBUGS ARMAGEDDON,A Fateful Reflection of a Dog And a Mad Scient...,2006,1,None,4,0.99,113,13.99,NC-17,Deleted Scenes,2006-02-15 05:03:42
2,571,METAL ARMAGEDDON,A Thrilling Display of a Lumberjack And a Croc...,2006,1,None,6,2.99,161,26.99,PG-13,"Trailers,Commentaries,Deleted Scenes",2006-02-15 05:03:42
3,598,MOSQUITO ARMAGEDDON,A Thoughtful Character Study of a Waitress And...,2006,1,None,6,0.99,57,22.99,G,Trailers,2006-02-15 05:03:42
4,838,STAGECOACH ARMAGEDDON,A Touching Display of a Pioneer And a Butler w...,2006,1,None,5,4.99,112,25.99,R,"Trailers,Deleted Scenes",2006-02-15 05:03:42
5,844,STEERS ARMAGEDDON,A Stunning Character Study of a Car And a Girl...,2006,1,None,6,4.99,140,16.99,PG,"Trailers,Commentaries,Deleted Scenes,Behind th...",2006-02-15 05:03:42

In [14]:
film_titles = pd.read_sql_query('SELECT film_id, title AS "film_title" FROM sakila.film ', engine)
# film_titles.apply(lambda row: row.astype(str).str.contains('ARMAGEDDON').any(1), axis=1)

def search(regex: str, film_titles, case=False):
    """Search all the text columns of `df`, return rows with any matches."""
    textlikes = film_titles.select_dtypes(include=[object, "ARMAGEDDON"])
    return df[
        textlikes.apply(
            lambda column: column.str.contains(regex, regex=True, case=case, na=False)
        ).any(axis=1)
    ]
#search("ARMAGEDDON",film_titles)
#source: https://stackoverflow.com/questions/26640129/search-for-string-in-all-pandas-dataframe-columns-and-filter

4. Get 10 the longest films.

In [15]:
Longest_movies = pd.read_sql_query('SELECT DISTINCT length, title FROM sakila.film  ORDER BY length DESC ', engine)
Longest_movies.head(10)

   length               title
0     185       CHICAGO NORTH
1     185      CONTROL ANTHEM
2     185      DARN FORRESTER
3     185         GANGS PRIDE
4     185           HOME PITY
5     185       MUSCLE BRIGHT
6     185        POND SEATTLE
7     185  SOLDIERS EVOLUTION
8     185   SWEET BROTHERHOOD
9     185        WORST BANGER

5.How many films include Behind the Scenes content?

In [17]:
special_features_query = "SELECT COUNT(film_id) FROM film WHERE special_features LIKE '%%Behind the Scenes%%'"

special_features = pd.read_sql_query(special_features_query, engine)

special_features.head(10)

# still getting errors :(

   COUNT(film_id)
0             538

6. Which kind of movies (rating) have a mean duration of more than two hours?

In [19]:
movie_duration_query = """select rating as "movie rating", length as "Movie Length" 
                                from sakila.film
                                group by rating having avg(length) >= 120;"""

movie_duration = pd.read_sql_query(movie_duration_query, engine)
movie_duration.head(10)

  movie rating  Movie Length
0        PG-13            62

7. Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank.

In [22]:
movie_ranking_query = """SELECT film_id, title, length, RANK() OVER (ORDER BY length) AS length_rank
               FROM film
               WHERE length > 0 AND NOT ISNULL(length);"""

movie_ranking = pd.read_sql_query(movie_ranking_query,engine)
movie_ranking.head(10)

   film_id                title  length  length_rank
0       15         ALIEN CENTER      46            1
1      469            IRON MOON      46            1
2      504        KWAI HOMEWARD      46            1
3      505     LABYRINTH LEAGUE      46            1
4      730  RIDGEMONT SUBMARINE      46            1
5      237      DIVORCE SHINING      47            6
6      247      DOWNHILL ENOUGH      47            6
7      393       HALLOWEEN NUTS      47            6
8      398       HANOVER GALAXY      47            6
9      407           HAWK CHILL      47            6